[
  {
    "title": "Voice Assistant For Windows",
    "description": "Интеллектуальный голосовой ассистент, созданный на Python. Поддерживает распознавание и синтез речи, управление системой, работу с интернетом и интеграцию с различными библиотеками.",
    "longDescription": "Этот проект представляет собой интеллектуального голосового ассистента, разработанного на Python. Ассистент способен распознавать и синтезировать речь, что позволяет ему взаимодействовать с пользователем на естественном языке. Он может выполнять различные задачи, включая управление системой (открытие приложений, управление файлами), работу с интернетом (поиск информации, отправка сообщений) и интеграцию с различными библиотеками для расширения своих возможностей. Проект использует такие библиотеки, как SpeechRecognition для распознавания речи, Pyttsx3 для синтеза речи, а также Requests и BeautifulSoup4 для работы с веб-контентом. Ассистент также поддерживает функции управления звуком и мониторинга системы с помощью PyCaw и Psutil. Этот проект демонстрирует потенциал использования Python для создания сложных и полезных приложений в области искусственного интеллекта и обработки естественного языка.",
    "image": "/projects/project_2/banner.webp",
    "slug": "voice-assistent-for-windows",
    "github": "https://github.com/RustamovAkrom/Voices-Assistant-For-Windows",
    "deploy": null,
    "date": "2025-09-02",
    "technologies": [
      "Python",
      "SpeechRecognition",
      "Vosk",
      "Pyttsx3",
      "PyAutoGUI",
      "torch",
      "numpy",
      "Socket",
      "pyYAML",
      "gTTS",
      "uv",
      "playsound",
      "langdetect",
      "soundfile",
      "RapidFuzz"
    ],
    "screenshots": [
      {
        "src": "/projects/project_2/basic_opportunities.png",
        "alt": "Opportunities (basic)"
      },
      {
        "src": "/projects/project_2/example.png",
        "alt": "banner"
      },
      {
        "src": "/projects/project_2/structure.png",
        "alt": "structure"
      },
      {
        "src": "/projects/project_2/requirements.png",
        "alt": "requirements"
      },
      {
        "src": "/projects/project_2/config.png",
        "alt": "config"
      },
      {
        "src": "/projects/project_2/install_and_run.png",
        "alt": "installing and running"
      },
      {
        "src": "/projects/project_2/warnings.png",
        "alt": "warnings"
      }
    ]
  },
  {
  "title": "Autonomous Browser AI Agent",
  "description": "An autonomous AI agent that interacts with a web browser to execute complex multi-step tasks using AI-driven decisions and browser automation.",
  "longDescription": "Autonomous Browser AI Agent is an intelligent automation system built in Python that enables fully autonomous browser interactions. Instead of relying on hardcoded scripts or fixed navigation paths, the agent observes page elements and decides actions dynamically to complete tasks like session management, form interactions, navigating links, data extraction, and even workflow automation such as email handling, food ordering, and job applications. The agent supports persistent Chrome profiles to preserve sessions across runs and features a confidence-based authorization check with interactive login support.",
  "image": "/projects/project_9/banner.webp",
  "slug": "autonomous-browser-ai-agent",
  "github": "https://github.com/RustamovAkrom/AutomationBrowser",
  "deploy": null,
  "date": "2025-10-10",
  "technologies": [
    "Python",
    "Browser Automation",
    "Chrome DevTools Protocol",
    "AI Agent Logic",
    "LLM Integration",
    "Session Persistence",
    "Modular Architecture",
    "Env Configuration"
  ],
  "useCases": [
    {
      "title": "Mail Handling",
      "description": "Read the latest emails and remove spam messages automatically."
    },
    {
      "title": "Food Ordering",
      "description": "Place an order for food items (e.g., BBQ burgers and fries) based on user’s history."
    },
    {
      "title": "Job Application Automation",
      "description": "Search for relevant job listings on a site like hh.ru and apply with a cover letter."
    }
  ],
  "features": [
    "Autonomous decision-making without hardcoded URLs or selectors",
    "Persistent Chrome profile to maintain logged-in sessions",
    "Interactive login flow when required",
    "Authorization confidence scoring (0.0–1.0)",
    "Extendable with custom sub-agents and skills"
  ],
  "howItWorks": "The agent evaluates the visible elements on a page to determine actions dynamically. It checks a confidence score to determine if the user is logged in and, based on thresholds, either continues with automation or prompts for login. The modular skill system allows adding new capabilities easily.",
  "installationSteps": [
    "Clone the repository and enter its directory.",
    "Create a Python virtual environment and install dependencies from requirements.txt.",
    "Install Google Chrome if not already installed.",
    "Configure paths and settings in config/settings.py for Chrome path, profile, and timeouts."
  ],
  "runInstructions": "Execute `python main.py` in the terminal. After start, enter a natural language task (e.g., 'Read last 5 emails and delete spam'). The browser opens and execution begins. If login is needed, the agent pauses and waits for manual authentication.",
  "license": "MIT License"
},
  {
    "title": "Marketplace — Modern E-commerce Backend Platform",
    "description": "A high-performance, scalable e-commerce backend built with FastAPI, featuring clean architecture, JWT authentication, role-based access control, and modular domain design.",
    "longDescription": "Marketplace is a production-ready backend platform for a modern online marketplace, developed using FastAPI and clean architecture principles. The system covers all essential e-commerce features, including user authentication, product catalog management, shopping carts, orders, delivery logistics, image uploads, and role-based permissions.\n\nThe platform supports multiple user roles — Buyer, Seller, Courier, and Admin — each with strictly defined access rights. Authentication is implemented using secure JWT-based access and refresh tokens, with token revocation support for logout and session control. Passwords are hashed using bcrypt, and all API input/output data is validated using Pydantic.\n\nThe project follows an async-first design using asyncpg and aiofiles, ensuring high performance and scalability. Its modular structure allows each domain (users, products, orders, delivery, etc.) to be easily maintained, extended, or separated into independent microservices in the future.\n\nMarketplace is designed as a real-world backend solution suitable for production use and as a strong portfolio project demonstrating backend engineering best practices.",
    "image": "/projects/project_8/banner.webp",
    "slug": "marketplace-fastapi-backend",
    "github": "https://github.com/RustamovAkrom/Marketplace-FastAPI",
    "deploy": null,
    "date": "2025-09-02",
    "technologies": [
      "Python",
      "FastAPI",
      "PostgreSQL",
      "SQLAlchemy 2.0",
      "Alembic",
      "asyncpg",
      "JWT",
      "OAuth2",
      "Pydantic",
      "bcrypt",
      "aiofiles",
      "Redis",
      "Pytest",
      "GitHub Actions"
    ],
    "screenshots": [
      {
        "src": "/projects/project_8/architecture.webp",
        "alt": "Clean Architecture overview"
      },
      {
        "src": "/projects/project_8/database_diagram.webp",
        "alt": "Database schema diagram"
      }
    ]
  },
  {
    "title": "Blog Web App",
    "description": "Full-stack blog web application built with Django, and Bootstrap for the frontend, and other safety dependencies with PostgreSQL and Sqlite3 for the backend. Features include user authentication, CRUD operations for posts, and a responsive design.",
    "longDescription": "This project is a comprehensive full-stack blog web application developed using Django for the backend and Bootstrap for the frontend. The application is designed to provide a seamless user experience with features such as user authentication, allowing users to register, log in, and manage their profiles securely. It supports CRUD (Create, Read, Update, Delete) operations for blog posts, enabling users to create new posts, view existing ones, edit their content, and delete them as needed. The application is built with a responsive design using Bootstrap, ensuring it works well on various devices, from desktops to mobile phones. For data storage, the application utilizes PostgreSQL as the primary database and SQLite3 for development purposes. Additionally, the project incorporates several security-focused dependencies to enhance the safety and integrity of user data and interactions. Overall, this blog web application serves as a robust platform for users to share their thoughts and engage with content in a secure and user-friendly environment.",
    "image": "/projects/project_3/banner.webp",
    "slug": "blog-web-app",
    "github": "https://github.com/RustamovAkrom/Blog-Web-APP/",
    "deploy": null,
    "date": "2024-06-12",
    "technologies": [
      "Python",
      "Django",
      "Bootstrap",
      "PostgreSQL",
      "SQLite3",
      "rest_framework",
      "htmx-django",
      "rs256-jwt-auth",
      "seo-optimizer",
      "restframework-simple-jwt"
    ],
    "screenshots": [
      {
        "src": "/projects/project_3/home.png"
      },
      {
        "src": "/projects/project_3/login.png"
      },
      {
        "src": "/projects/project_3/register.png"
      },
      {
        "src": "/projects/project_3/post-detail.png"
      },
      {
        "src": "/projects/project_3/admin-home.png"
      },
      {
        "src": "/projects/project_3/admin-models.png"
      },
      {
        "src": "/projects/project_3/admin-posts.png"
      },
      {
        "src": "/projects/project_3/admin-update.png"
      }
    ]
  },
  {
    "title": "Next.JS Blog + Sanity CMS",
    "description": "Modern portfolio web application built with Next.js and a headless CMS. Features include dynamic content management, responsive design, and fast performance.",
    "longDescription": "This project is a modern portfolio web application developed using Next.js for the frontend and a headless CMS for content management. The application allows easy creation and management of portfolio items, blog posts, and other dynamic content without manual coding. It is designed with a responsive layout, ensuring optimal display across desktops, tablets, and mobile devices. Next.js provides server-side rendering and static site generation for improved performance and SEO. The CMS integration allows content updates in real time, making the application flexible and scalable for future additions. Overall, this portfolio platform combines modern frontend technologies with a powerful content management system to provide a fast, secure, and user-friendly experience for both visitors and content managers.",
    "image": "/projects/project_4/banner-light.webp",
    "slug": "nextjs-blog-sanity-cms",
    "github": "https://github.com/RustamovAkrom/Next-JS-BLog/",
    "deploy": "https://akromblogdev.vercel.app",
    "date": "2024-06-12",
    "technologies": [
      "Next.js",
      "Sanity",
      "CMS"
    ],
    "screenshots": [
      {
        "src": "/projects/project_4/home-dark.png"
      },
      {
        "src": "/projects/project_4/home-light.png"
      },
      {
        "src": "/projects/project_4/posts-dark.png"
      },
      {
        "src": "/projects/project_4/posts-light.png"
      },
      {
        "src": "/projects/project_4/about-dark.png"
      },
      {
        "src": "/projects/project_4/about-light.png"
      },
      {
        "src": "/projects/project_4/contact-dark.png"
      },
      {
        "src": "/projects/project_4/contact-light.png"
      },
      {
        "src": "/projects/project_4/banner-dark.webp"
      }
    ]
  },
  {
    "title": "SpotifyAPI",
    "description": "A Django REST API project for interacting with Spotify data. Provides endpoints for tracks, playlists, and users with JWT authentication and background tasks using Celery.",
    "longDescription": "SpotifyAPI is a comprehensive Django REST Framework project that allows developers to interact with Spotify data programmatically. The API supports retrieving information about tracks, playlists, and user profiles. It includes JWT-based authentication for secure access to protected endpoints and integrates Celery for handling asynchronous background tasks such as periodic updates or data processing. The backend uses PostgreSQL for efficient storage and management of data. Additionally, the project provides interactive API documentation through Swagger/OpenAPI, making it easy for developers to test and explore the available endpoints. This project demonstrates a full-stack backend setup with modern tools and best practices for building scalable and maintainable APIs.",
    "image": "/projects/project_5/banner.webp",
    "slug": "spotifyapi",
    "github": "https://github.com/RustamovAkrom/SpotifyAPI",
    "deploy": null,
    "date": "2025-09-29",
    "technologies": [
      "Python",
      "Django",
      "Django REST Framework",
      "Celery",
      "PostgreSQL",
      "JWT",
      "Swagger",
      "Redis"
    ],
    "screenshots": [
      {
        "src": "/projects/project_5/image-1.webp",
        "alt": "image-1"
      },
      {
        "src": "/projects/project_5/image-2.webp",
        "alt": "imaeg-2"
      },
      {
        "src": "/projects/project_5/image-3.webp",
        "alt": "image-3"
      },
      {
        "src": "/projects/project_5/image-4.webp",
        "alt": "image-4"
      },
      {
        "src": "/projects/project_5/image-5.webp",
        "alt": "image-5"
      }
    ]
  },
  {
    "title": "Tracks Web App (Backend & Frontend)",
    "description": "Full-stack music management web app built with Django REST Framework and Next.js. Includes JWT authentication, Celery background tasks, Redis caching, and a modern responsive frontend powered by Tailwind CSS.",
    "longDescription": "Tracks Web App is a complete full-stack project combining a Django REST API backend and a modern Next.js frontend. The backend provides endpoints for tracks, playlists, and user management, secured with JWT-based authentication. It integrates Celery and Redis for asynchronous background jobs, PostgreSQL for structured data storage, and includes Swagger/OpenAPI documentation for interactive API exploration. Monitoring and observability are supported via Prometheus and Sentry. The project also features modern development tools like Docker for containerization, Ruff and Black for code formatting, Mypy for type checking, and Pytest for automated testing. The frontend, built with Next.js 15 and React 19, uses Tailwind CSS, Framer Motion, and Radix UI to deliver a sleek, responsive, and animated interface. Axios handles API communication, while Next Themes provides theme switching support. Together, these technologies form a scalable, maintainable, and production-ready full-stack web application.",
    "image": "/projects/project_6/banner.webp",
    "slug": "tracks-webapp-backend-frontend",
    "github": "https://github.com/RustamovAkrom/Tracks-BF",
    "deploy": null,
    "date": "2025-09-29",
    "technologies": [
      "Python",
      "Django REST Framework",
      "PostgreSQL",
      "DRF SimpleJWT",
      "DRF Spectacular Sidecar",
      "Swagger / OpenAPI",
      "Django Unfold",
      "Django Modeltranslation",
      "Docker",
      "uv (Python dependency manager)",
      "Next.js 15",
      "Tailwind CSS 4",
      "Framer Motion",
      "Radix UI",
      "Lucide React",
      "Axios",
      "Next Themes",
      "Tailwind Merge",
      "TypeScript",
      "ESLint"
    ],
    "screenshots": [
      {
        "src": "/projects/project_6/home-dark.webp",
        "alt": "home dark"
      },
      {
        "src": "/projects/project_6/tracks-light.webp",
        "alt": "tracks light"
      },
      {
        "src": "/projects/project_6/tracks-dark.webp",
        "alt": "tracks dark"
      },
      {
        "src": "/projects/project_6/track-detail-light.webp",
        "alt": "track detail light"
      },
      {
        "src": "/projects/project_6/track-detail-dark.webp",
        "alt": "track detail dark"
      },
      {
        "src": "/projects/project_6/artists-light.webp",
        "alt": "artists light"
      },
      {
        "src": "/projects/project_6/artists-dark.webp",
        "alt": "artists dark"
      },
      {
        "src": "/projects/project_6/albums-light.webp",
        "alt": "albums light"
      },
      {
        "src": "/projects/project_6/albums-dark.webp",
        "alt": "albums dark"
      },
      {
        "src": "/projects/project_6/profile-light.webp",
        "alt": "profile light"
      },
      {
        "src": "/projects/project_6/profile-dark.webp",
        "alt": "profile dark"
      },
      {
        "src": "/projects/project_6/home-light.webp",
        "alt": "home light"
      }
    ]
  },
  {
    "title": "Backend Cheats",
    "description": "All-in-one backend cheatsheet for developers — networking, Linux, databases, APIs, and more, ready to boost your productivity.",
    "longDescription": "Backend Cheats is your ultimate cheat sheet for backend development. Quickly access essential topics like networking, Linux, databases, APIs, and programming concepts with clear explanations and practical examples. Perfect for fast learning and quick reference.",
    "image": "/projects/project_7/1.webp",
    "slug": "backend-cheats",
    "github": "https://github.com/RustamovAkrom/backend-cheats",
    "deploy": "https://backend-chets.netlify.app/",
    "date": "2025-11-15",
    "technologies": [
      "Markdown",
      "React",
      "Next.js",
      "TailwindCSS",
      "Netlify",
      "JavaScript"
    ],
    "screenshots": [
      {
        "src": "/projects/project_7/1.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/2.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/3.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/4.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/5.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/6.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/7.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/8.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/9.webp",
        "alt": "Network section"
      },
      {
        "src": "/projects/project_7/10.webp",
        "alt": "Network section"
      }
    ]
  }
]